src/main/java/ru/vk/itmo/test/emelyanovvitaliy/reports/5/wrk_put.txt
Running 30s test @ http://192.168.0.193:8080
  1 threads and 64 connections
  Thread calibration: mean lat.: 125.116ms, rate sampling interval: 1057ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21ms  453.97us   8.70ms   82.58%
    Req/Sec     7.35k   436.02     7.51k    88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.37ms
 90.000%    1.70ms
 99.000%    2.88ms
 99.900%    5.15ms
 99.990%    7.80ms
 99.999%    8.69ms
100.000%    8.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.278     0.000000            1         1.00
       0.802     0.100000        14418         1.11
       0.887     0.200000        28911         1.25
       0.981     0.300000        43130         1.43
       1.062     0.400000        57528         1.67
       1.127     0.500000        71896         2.00
       1.159     0.550000        79147         2.22
       1.196     0.600000        86226         2.50
       1.242     0.650000        93490         2.86
       1.298     0.700000       100618         3.33
       1.372     0.750000       107858         4.00
       1.419     0.775000       111424         4.44
       1.480     0.800000       114992         5.00
       1.544     0.825000       118571         5.71
       1.598     0.850000       122190         6.67
       1.646     0.875000       125815         8.00
       1.671     0.887500       127591         8.89
       1.696     0.900000       129353        10.00
       1.723     0.912500       131135        11.43
       1.755     0.925000       132962        13.33
       1.798     0.937500       134721        16.00
       1.826     0.943750       135633        17.78
       1.854     0.950000       136529        20.00
       1.879     0.956250       137446        22.86
       1.904     0.962500       138337        26.67
       1.942     0.968750       139216        32.00
       1.975     0.971875       139668        35.56
       2.036     0.975000       140111        40.00
       2.149     0.978125       140563        45.71
       2.339     0.981250       141014        53.33
       2.539     0.984375       141455        64.00
       2.621     0.985938       141683        71.11
       2.707     0.987500       141906        80.00
       2.807     0.989062       142136        91.43
       2.953     0.990625       142353       106.67
       3.177     0.992188       142579       128.00
       3.311     0.992969       142692       142.22
       3.437     0.993750       142802       160.00
       3.587     0.994531       142915       182.86
       3.741     0.995313       143027       213.33
       3.909     0.996094       143139       256.00
       4.007     0.996484       143196       284.44
       4.099     0.996875       143252       320.00
       4.235     0.997266       143308       365.71
       4.343     0.997656       143364       426.67
       4.551     0.998047       143420       512.00
       4.643     0.998242       143448       568.89
       4.763     0.998437       143476       640.00
       4.875     0.998633       143504       731.43
       4.995     0.998828       143532       853.33
       5.171     0.999023       143560      1024.00
       5.287     0.999121       143574      1137.78
       5.471     0.999219       143588      1280.00
       5.595     0.999316       143602      1462.86
       5.975     0.999414       143616      1706.67
       6.163     0.999512       143630      2048.00
       6.379     0.999561       143637      2275.56
       6.627     0.999609       143644      2560.00
       6.727     0.999658       143652      2925.71
       6.887     0.999707       143658      3413.33
       7.051     0.999756       143665      4096.00
       7.247     0.999780       143669      4551.11
       7.315     0.999805       143672      5120.00
       7.387     0.999829       143676      5851.43
       7.523     0.999854       143679      6826.67
       7.707     0.999878       143683      8192.00
       7.799     0.999890       143686      9102.22
       7.799     0.999902       143686     10240.00
       7.827     0.999915       143688     11702.86
       7.939     0.999927       143690     13653.33
       8.019     0.999939       143692     16384.00
       8.135     0.999945       143693     18204.44
       8.135     0.999951       143693     20480.00
       8.207     0.999957       143694     23405.71
       8.279     0.999963       143695     27306.67
       8.375     0.999969       143696     32768.00
       8.495     0.999973       143697     36408.89
       8.495     0.999976       143697     40960.00
       8.495     0.999979       143697     46811.43
       8.623     0.999982       143698     54613.33
       8.623     0.999985       143698     65536.00
       8.687     0.999986       143699     72817.78
       8.687     0.999988       143699     81920.00
       8.687     0.999989       143699     93622.86
       8.687     0.999991       143699    109226.67
       8.687     0.999992       143699    131072.00
       8.711     0.999993       143700    145635.56
       8.711     1.000000       143700          inf
#[Mean    =        1.211, StdDeviation   =        0.454]
#[Max     =        8.704, Total count    =       143700]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  231977 requests in 30.00s, 14.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 651
  Non-2xx or 3xx or 404 responses: 74
Requests/sec:   7732.37
Transfer/sec:    505.91KB